'''
dictMenu={'卡布奇洛':32,'摩卡':30,'抹茶蛋糕':28,'布朗尼':26}
sum=0
d=dictMenu.values()
 sum+=values
 print(sum)
 '''
 '''
 l1=['请弓', '请箭', '请刀', '请甲', '请枪旗', '请锅幕', '请马', ' 请衣赐', '请粮料','请草料', '请车牛', '请船', '请攻城守具', '请添兵', '请移营', '请进军', '请退军', '请固守', '未见贼', ' 见贼讫', '贼多', '贼少', '贼相敌', '贼添兵', '贼移营', '贼进兵', '贼退兵', '贼固守', '围得贼城', '解围城', '被贼围', '贼围解', '战不胜', '战大胜', '战大捷', '将士投降', '将士叛', '士卒病', '都将病', '战小胜']
l2=list('城阙辅三秦,风烟望五津.与君离别意,同是宦游人.海内存知己,天涯若比邻.无为在歧路,儿女共沾巾.'.replace('.','') .replace(', ',''))
d=dict(zip(l1,l2))
q=input('请输入战斗情况: ')
print('密码是: ',d[q])
'''
'''
tg=["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"]
dz=["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"]
tg1=["庚", "己", "戊", "丁", "丙", "乙", "甲","癸","壬","辛"]
dz1=["子","亥","戌", "酉", "申", "未", "午", "巳", "辰", "卯", "寅", "丑"]
N=int(input())
if N==2020:
    print(tg[6]+dz[0])
elif N>2020:
    print(tg[(6+N-2020)%10]+dz[(0+N-2020)%12])
else:
    print(tg1[(2020-N)%10]+dz1[(2020-N)%12])
    
    '''

    '''
    dictMenu={'卡布奇洛':32,'摩卡':30,'抹茶蛋糕':28,'布朗尼':26}
sum=0
d=dictMenu.values()
for i in d:
 sum+=i
 print(sum)

 '''

 '''
 dictd={"西游记":"吴承恩","三国演义":"罗贯中","红楼梦":"曹雪芹","儒林外史":"吴敬梓"}

dictd["水浒"]="施耐庵"
dictd["曹雪芹"]="曹雪芹,高鹗"
del dictd["曹雪芹"]
dictd["红楼梦"]="曹雪芹,高鹗"
del dictd["儒林外史"]

for i in dictd:
    print(f'{dictd[i]}:{i}')

'''

'''
ls = ["综合", "理工", "综合", "综合", "综合", "综合", "综合", "综合", "综合", "综合","师范", "理工", "综合", "理工", "综合", "综合", "综合", "综合", "综合","理工","理工", "理工", "理工", "师范", "综合", "农林", "理工", "综合", "理工", "理工","理工", "综合", "理工", "综合", "综合", "理工", "农林", "民族", "军事"]
counts = {}
for word in ls:
    counts[word]=counts.get(word,0)+1
for i in counts:
    print("{0}：{1}".format(i, counts[i]))
'''
'''
value = sum([2 ** i for i in range(64)])
print(value)
'''

'''
s='1 请弓、2 请箭、3 请刀、4 请甲、5 请枪旗、6 请锅幕、7 请马、8 请衣赐、9 请粮料、10 请草料、11 请车牛、12 请船、13 请攻城守具、14请添兵、15请移营、16请进军、17请退军、18请固守、19未见贼、20 见贼讫、21贼多、22贼少、23 贼相敌、24 贼添兵、25 贼移营、26 贼进兵、27 贼退兵、28 贼固守、29 围得贼城、30 解围城、31 被贼围、32 贼围解、33 战不胜、34 战大胜、35 战大捷、36 将士投降、37 将士叛、38 士卒病、39 都将病、40 战小胜'
s=s.replace(s[1],'')
for i in range(10):
 s=s.replace(str(i),'')
l1=s.split('、')
l2=list("城阙辅三秦,风烟望五津。与君离别意,同是宦游人。海内存知己,天涯若比邻。无为在歧路,儿女共沾巾。".replace('。','').replace('，',''))
d=dict(zip(l1,l2))
q=input('请输入战斗情况：')
print('密码是：',d[q])
'''
'''
list_str = []
list_num = []
bit_str = {}
while(1):
    s = input()
    if s=='-1':
        break
    list_num.append(len(s))
    list_str.append(s)
    bit_str[s] = len(s)
 
list_str2 = sorted(bit_str.items(),key=lambda x:x[1],reverse=False)
for i in list_str2:
    print(i[0],end = ' ')
'''

